рецепты = {
    # ===== ЗЕЛЬЯ =====
    "зелье здоровья": {
        "ресурсы": ["трава", "вода", "кровь пиявки"],
        "количество": 1,
        "описание": "Смешать траву с водой"
    },

    # ===== ОРУЖИЕ =====
    "лезвие": {
        "ресурсы": ["ржавый металл"],
        "количество": 1,
        "описание": "Заточить металл"
    },
    "призрачный меч": {
        "ресурсы": ["лезвие", "призрачная пыль", "призрачная пыль"],
        "количество": 1,
        "описание": "Зачаровать лезвие призрачной пылью"
    },

    # ===== МЕХАНИЗМЫ =====
    "шестерёнка": {
        "ресурсы": ["ржавый металл","ржавый металл","ржавый металл"],
        "количество": 2,
        "описание": "Выковать шестерёнку"
    },

    # ===== ЕДА =====
    "блины": {
        "ресурсы": ["мука", "яйцо"],
        "количество": 3,
        "описание": "Испечь блины"
    },
    "рыба": {
        "ресурсы": ["вода"],
        "количество": 1,
        "описание": "Поймать рыбу в пруду"
    },

    # ===== БРОНЯ =====
    "кожаная броня": {
        "ресурсы": ["шкура", "шкура", "шкура","шкура", "шкура", "шкура"],
        "количество": 1,
        "описание": "Сшить броню из трёх шкур"
    },
    "кольчужная броня": {
        "ресурсы": ["ржавый металл", "ржавый металл", "ржавый металл", "шестерёнка"],
        "количество": 1,
        "описание": "Сковать кольчугу из металла с шестерёнками"
    },
}
