классы = {
    "Воин": {
        "цвет": (45, 27, 27),
        "описание": "Мастер ближнего боя",
        "начальные_атрибуты": {
            "сила": 6,
            "ловкость": 10,
            "интеллект": 8,
            "стойкость": 9
        },
        "начальные_умения": {
            "кулинария": 0,
            "алхимия": 0,
            "кузнечное_дело": 1
        },
        "стартовое_оружие": "лезвие",
        "стартовая_броня": "мантия",
        "стартовые_предметы": ["хлеб", "зелье здоровья"]
    },

    "Лучник": {
        "цвет": (26, 46, 26),
        "описание": "Стрелок, полагающийся на скорость",
        "начальные_атрибуты": {
            "сила": 10,
            "ловкость": 15,
            "интеллект": 8,
            "стойкость": 10
        },
        "начальные_умения": {
            "кулинария": 0,
            "алхимия": 1,
            "кузнечное_дело": 0
        },
        "стартовое_оружие": "лук",
        "стартовая_броня": "кожаная броня",
        "стартовые_предметы": ["хлеб", "стрелы"]
    },

    "Маг": {
        "цвет": (26, 26, 66),
        "описание": "Повелитель стихий",
        "начальные_атрибуты": {
            "сила": 8,
            "ловкость": 10,
            "интеллект": 15,
            "стойкость": 10
        },
        "начальные_умения": {
            "кулинария": 0,
            "алхимия": 2,
            "кузнечное_дело": 0
        },
        "стартовое_оружие": "посох",
        "стартовая_броня": "мантия",
        "стартовые_предметы": ["хлеб", "малый кристалл маны"]
    },

    "Вор": {
        "цвет": (46, 26, 46),
        "описание": "Мастер теней и коварства",
        "начальные_атрибуты": {
            "сила": 10,
            "ловкость": 15,
            "интеллект": 8,
            "стойкость": 10
        },
        "начальные_умения": {
            "кулинария": 1,
            "алхимия": 1,
            "кузнечное_дело": 0
        },
        "стартовое_оружие": "кинжал",
        "стартовая_броня": "кожаная броня",
        "стартовые_предметы": ["хлеб", "отмычка"]
    }
}