торговцы = {
    "Холл": {
        "имя": "Странствующий купец",
        "приветствие": "Заходи, путник! Есть редкие товары!",
        "квесты": False,
        "товары": {
            "зелье здоровья": {"цена": 15},
            "фрукты": {"цена": 3},
            "блины": {"цена": 5},
            "ржавый меч": {'цена': 150},
            "хлеб": {'цена': 25}
        },
        "советы": [
            "Слышал, в Саду мастерская есть, да только дверь заперта. Масло бы туда...",
            "На кухне можно еду найти, если повезёт.",
            "Осторожнее в Коридоре. Призраки там... Их пыль магией пахнет."
        ]
    },

    "Убежище": {
        "имя": "Странствующий купец",
        "приветствие": "Заходи, путник! Есть редкие товары!",
        "квесты": True,
        "товары": {
            "зелье здоровья": {"цена": 15},
            "хлеб": {'цена': 25},
            "фрукты": {"цена": 3},
            "блины": {"цена": 5},
            "ржавый меч": {'цена': 150},
            "бутылка воды": {'цена': 15}
        },
        "советы": [
            "Слышал, в Саду мастерская есть, да только дверь заперта. Масло бы туда...",
            "На кухне можно еду найти, если повезёт.",
            "Осторожнее в Коридоре. Призраки там... Их пыль магией пахнет.",
            "Всегда бери с собой еду."
        ]
    },

    "Мастерская": {
        "имя": "Изобретатель",
        "приветствие": "Шестерёнки, металл, механизмы!",
        "квесты": False,
        "товары": {
            "ржавый металл": {"цена": 8},
            "шестерёнка": {"цена": 10},
            "лезвие": {"цена": 12}
        },
        "советы": [
            "Если соберёшь 5 призрачной пыли, сможешь сломать печать на Лестнице.",
            "Королевский герб? Слышал, он в Темнице где-то спрятан."
        ]
    },

    "Пруд": {
        "имя": "Водяной отшельник",
        "приветствие": "Из глубины вод... редкие сокровища...",
        "квесты": False,
        "товары": {
            "рыба": {"цена": 5},
            "тина": {"цена": 1},
            "жемчужина": {"цена": 40},
            "призрачная пыль": {"цена": 8},
            "вода": {"цена": 2}
        },
        "советы": [
            "В Мастерской кузнец живёт. У него шестерёнки покупай, броню ковать.",
            "На кухне блины пекут. Мне б таких..."
        ]
    }
}